Repository: nokichan/immich-gnome-wallpaper
Catalog: po/*.po
Languages: ca, es

source: Connection Settings
ca: Configuració de Connexió
es: Configuración de Conexión

source: Configure your Immich server connection
ca: Configura la connexió amb el teu servidor Immich
es: Configura la conexión con tu servidor Immich

source: Server URL
ca: URL del Servidor
es: URL del Servidor

source: Email
ca: Correu Electrònic
es: Correo Electrónico

source: Password
ca: Contrasenya
es: Contraseña

source: Wallpaper Settings
ca: Configuració del Fons de Pantalla
es: Configuración de Fondo de Pantalla

source: Configure wallpaper rotation behavior
ca: Configura el comportament de la rotació del fons
es: Configura el comportamiento de rotación de fondos

source: Change Interval (seconds)
ca: Temps de Interval de Canvi (segons)
es: Intervalo de Cambio (segundos)

source: Time between wallpaper changes
ca: Temps entre canvis de fons
es: Tiempo entre cambios de fondo

source: Picture Options
ca: Opcions d'Imatge
es: Opciones de Imagen

source: How to display the wallpaper
ca: Com mostrar el fons de pantalla
es: Cómo mostrar el fondo de pantalla

source: Background Color
ca: Color de Fons
es: Color de Fondo

source: Color displayed around photos
ca: Color mostrat al voltant de les fotos
es: Color mostrado alrededor de las fotos

source: Location Settings
ca: Configuració d'Ubicació
es: Configuración de Ubicación

source: Display photo location from EXIF data
ca: Mostrar ubicació de la foto des de dades EXIF
es: Mostrar ubicación de la foto desde datos EXIF

source: Show Location
ca: Mostrar Ubicació
es: Mostrar Ubicación

source: Display location overlay if photo has geolocation data
ca: Mostrar notificació d'ubicació si la foto té dades de geolocalització
es: Mostrar notificación de ubicación si la foto tiene datos de geolocalización

source: Map Provider
ca: Proveïdor de Mapes
es: Proveedor de Mapas

source: Which map service to open when clicking location
ca: Quin servei de mapes obrir en fer clic a la ubicació
es: Qué servicio de mapas abrir al hacer clic en la ubicación

source: Album Selection
ca: Selecció d'Àlbum
es: Selección de Álbum

source: Choose which album to use for wallpapers
ca: Tria quin àlbum utilitzar per als fons
es: Elige qué álbum usar para los fondos

source: All Photos (no filter)
ca: Totes les Fotos (sense filtre)
es: Todas las Fotos (sin filtro)

source: Select Album
ca: Seleccionar Àlbum
es: Seleccionar Álbum

source: Loading albums...
ca: Carregant àlbums...
es: Cargando álbumes...

source: Please configure server connection first
ca: Si us plau configura primer la connexió al servidor
es: Por favor configura primero la conexión al servidor

source: Authentication failed. Check your credentials.
ca: Error d'autenticació. Verifica les teves credencials.
es: Error de autenticación. Verifica tus credenciales.

source: Failed to load albums
ca: Error en carregar els àlbums
es: Error al cargar los álbumes

source: Error loading albums. Check your connection.
ca: Error en carregar àlbums. Verifica la teva connexió.
es: Error al cargar álbumes. Verifica tu conexión.

source: Test Connection
es: Probar Conexión

source: Verify your server credentials
es: Verifica las credenciales de tu servidor

source: Test
es: Probar

source: Testing...
es: Probando...

source: Connection successful!
es: ¡Conexión exitosa!

source: Connection failed
es: Conexión fallida

source: Refresh Albums
es: Actualizar Álbumes

source: Reload the album list from server
es: Recargar la lista de álbumes desde el servidor

source: Refreshing...
es: Actualizando...

source: Please fill in all connection fields
es: Por favor rellena todos los campos de conexión

source: Invalid server URL
es: URL del servidor inválida

source: Invalid server URL format
es: Formato de URL del servidor inválido

source: Could not connect to server
es: No se pudo conectar al servidor

source: Invalid email or password
es: Correo o contraseña inválidos

source: Server error (status %d)
es: Error del servidor (estado %d)

source: Empty response from server
es: Respuesta vacía del servidor

source: No access token received
es: No se recibió token de acceso

source: Connection error: %s
es: Error de conexión: %s

source: %d albums available
es: %d álbumes disponibles

source: Error loading albums
es: Error al cargar álbumes

source: Panel Icon
es: Icono del Panel

source: Show an icon in the top panel with photo information
es: Mostrar un icono en el panel superior con información de la foto

source: Show Panel Icon
es: Mostrar Icono del Panel

source: Display an icon in the top panel with photo details
es: Mostrar un icono en el panel superior con detalles de la foto

source: No photo loaded
es: Ninguna foto cargada

source: No location available
es: Ubicación no disponible

source: Next Wallpaper
es: Siguiente Fondo

source: No description available
es: Sin descripción disponible
